nrfconnect/sdk-nrf/drivers/wifi/nrf71/src/fmac_main.c
	if (!vif_ctx_zep) {
		LOG_ERR("%s: vif_ctx_zep is NULL", __func__);
		return;
	}

	rpu_ctx_zep = vif_ctx_zep->rpu_ctx_zep;
	fmac_dev_ctx = rpu_ctx_zep->rpu_ctx;

	LOG_DBG("%s: cookie_rsp_event->cookie = %llx", __func__, cookie_rsp_event->cookie);
	LOG_DBG("%s: host_cookie = %llx", __func__, cookie_rsp_event->host_cookie);
	LOG_DBG("%s: mac_addr = %x:%x:%x:%x:%x:%x", __func__,
		cookie_rsp_event->mac_addr[0],
		cookie_rsp_event->mac_addr[1],
		cookie_rsp_event->mac_addr[2],
		cookie_rsp_event->mac_addr[3],
		cookie_rsp_event->mac_addr[4],
		cookie_rsp_event->mac_addr[5]);

	vif_ctx_zep->cookie_resp_received = true;
	/* TODO: When supp_callbk_fns.mgmt_tx_status is implemented, add logic
	 * here to use the cookie and host_cookie to map requests to responses.
	 */
	if (vif_ctx_zep->supp_drv_if_ctx &&
		vif_ctx_zep->supp_callbk_fns.cookie_event) {
		vif_ctx_zep->supp_callbk_fns.cookie_event(vif_ctx_zep->supp_drv_if_ctx,
			cookie_rsp_event->host_cookie, cookie_rsp_event->cookie);
		}
}
#endif /* CONFIG_NRF71_STA_MODE */

void reg_change_callbk_fn(void *vif_ctx,
			  struct nrf_wifi_event_regulatory_change *reg_change_event,
			  unsigned int event_len)
{
	struct nrf_wifi_vif_ctx_zep *vif_ctx_zep = NULL;
	struct nrf_wifi_ctx_zep *rpu_ctx_zep = NULL;
	struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx = NULL;

	LOG_DBG("%s: Regulatory change event received", __func__);

	vif_ctx_zep = vif_ctx;

	if (!vif_ctx_zep) {
		LOG_ERR("%s: vif_ctx_zep is NULL", __func__);
		return;
	}

	rpu_ctx_zep = vif_ctx_zep->rpu_ctx_zep;
	if (!rpu_ctx_zep) {
		LOG_ERR("%s: rpu_ctx_zep is NULL", __func__);
		return;
	}

	fmac_dev_ctx = rpu_ctx_zep->rpu_ctx;
	if (!fmac_dev_ctx) {
		LOG_ERR("%s: fmac_dev_ctx is NULL", __func__);
		return;
	}

	if (!fmac_dev_ctx->waiting_for_reg_event) {
		LOG_DBG("%s: Unsolicited regulatory change event", __func__);
		/* TODO: Handle unsolicited regulatory change event */
		return;
	}

	fmac_dev_ctx->reg_change = nrf_wifi_osal_mem_alloc(sizeof(struct
							   nrf_wifi_event_regulatory_change));
	if (!fmac_dev_ctx->reg_change) {
		LOG_ERR("%s: Failed to allocate memory for reg_change", __func__);
		return;
	}

	memcpy(fmac_dev_ctx->reg_change,
		   reg_change_event,
		   sizeof(struct nrf_wifi_event_regulatory_change));
	fmac_dev_ctx->reg_set_status = true;
}

#if defined(CONFIG_NRF71_RAW_DATA_TX) || defined(CONFIG_NRF71_RAW_DATA_RX)
void nrf_wifi_event_proc_channel_set_done_zep(void *os_vif_ctx,
	struct nrf_wifi_event_set_channel *channel_event,
	unsigned int event_len)
{
	struct nrf_wifi_vif_ctx_zep *vif_ctx_zep = NULL;
	struct nrf_wifi_ctx_zep *rpu_ctx_zep = NULL;

	(void)event_len;
	if (!channel_event) {
		return;
	}
	vif_ctx_zep = os_vif_ctx;
	rpu_ctx_zep = vif_ctx_zep ? vif_ctx_zep->rpu_ctx_zep : &rpu_drv_priv_zep.rpu_ctx_zep;
	if (rpu_ctx_zep) {
		rpu_ctx_zep->channel_set_status = channel_event->status;
		k_sem_give(&rpu_ctx_zep->channel_set_done_sem);
	}
}
#endif /* CONFIG_NRF71_RAW_DATA_TX || CONFIG_NRF71_RAW_DATA_RX */
#endif /* !CONFIG_NRF71_RADIO_TEST */


/**
 * @brief Get operating band bitmap from Kconfig (see NRF_WIFI_OP_BAND_* in
 * nrf71_wifi_ctrl.h / nrf71_wifi_common.h).
 *
 * @return Bitmap of bands (NRF_WIFI_OP_BAND_2GHZ, NRF_WIFI_OP_BAND_5GHZ,
 *         NRF_WIFI_OP_BAND_6GHZ).
 */
unsigned char get_nrf_wifi_op_band(void)
{
	if (IS_ENABLED(CONFIG_NRF_WIFI_2G_BAND)) {
		return NRF_WIFI_OP_BAND_2GHZ;
	}
	if (IS_ENABLED(CONFIG_NRF_WIFI_5G_BAND)) {
		return NRF_WIFI_OP_BAND_5GHZ;
	}
	if (IS_ENABLED(CONFIG_NRF_WIFI_6G_BAND)) {
		return NRF_WIFI_OP_BAND_6GHZ;
	}
	if (IS_ENABLED(CONFIG_NRF_WIFI_DUAL_BAND)) {
		return NRF_WIFI_OP_BAND_2GHZ | NRF_WIFI_OP_BAND_5GHZ;
	}
	return NRF_WIFI_OP_BAND_2GHZ | NRF_WIFI_OP_BAND_5GHZ | NRF_WIFI_OP_BAND_6GHZ;
}

/* The RF front-end description lives on the Wi-Fi node, the parent of the wlan
 * interface nodes. Look it up by compatible so it cannot silently bind to the
 * wrong node.
 */
#define NRF71_WIFI_NODE DT_INST(0, nordic_nrf7120_wifi)

/* The UMAC structure uses 0.25 dBm, while DTS and the RF parameter strings
 * both use 1 dBm.
 */
#define MAX_TX_PWR(label) (DT_PROP(NRF71_WIFI_NODE, label) * 4)
#define MAX_TX_PWR_DBM(label) DT_PROP(NRF71_WIFI_NODE, label)

void configure_tx_pwr_settings(struct nrf_wifi_tx_pwr_ctrl_params *tx_pwr_ctrl_params,
			       struct nrf_wifi_tx_pwr_ceil_params *tx_pwr_ceil_params)
{
	memset(tx_pwr_ctrl_params, 0, sizeof(*tx_pwr_ctrl_params));

	tx_pwr_ctrl_params->ant_gain_2g = DT_PROP(NRF71_WIFI_NODE, nordic_wifi_ant_gain_2g);
	tx_pwr_ctrl_params->ant_gain_5g_band1 =
		DT_PROP(NRF71_WIFI_NODE, nordic_wifi_ant_gain_5g_band1);
	tx_pwr_ctrl_params->ant_gain_5g_band2 =
		DT_PROP(NRF71_WIFI_NODE, nordic_wifi_ant_gain_5g_band2);
	tx_pwr_ctrl_params->ant_gain_5g_band3 =
		DT_PROP(NRF71_WIFI_NODE, nordic_wifi_ant_gain_5g_band3);
	tx_pwr_ctrl_params->ant_gain_6g_band1 =
		DT_PROP(NRF71_WIFI_NODE, nordic_wifi_ant_gain_6g_band1);
	tx_pwr_ctrl_params->ant_gain_6g_band2 =
		DT_PROP(NRF71_WIFI_NODE, nordic_wifi_ant_gain_6g_band2);
	tx_pwr_ctrl_params->ant_gain_6g_band3 =
		DT_PROP(NRF71_WIFI_NODE, nordic_wifi_ant_gain_6g_band3);
	tx_pwr_ctrl_params->ant_gain_6g_band4 =
		DT_PROP(NRF71_WIFI_NODE, nordic_wifi_ant_gain_6g_band4);
	tx_pwr_ctrl_params->ant_gain_6g_band5 =
		DT_PROP(NRF71_WIFI_NODE, nordic_wifi_ant_gain_6g_band5);
	tx_pwr_ctrl_params->ant_gain_6g_band6 =
		DT_PROP(NRF71_WIFI_NODE, nordic_wifi_ant_gain_6g_band6);

	tx_pwr_ceil_params->max_pwr_2g_dsss = MAX_TX_PWR(wifi_max_tx_pwr_2g_dsss);
	tx_pwr_ceil_params->max_pwr_2g_mcs0 = MAX_TX_PWR(wifi_max_tx_pwr_2g_mcs0);
	tx_pwr_ceil_params->max_pwr_2g_mcs7 = MAX_TX_PWR(wifi_max_tx_pwr_2g_mcs7);
	tx_pwr_ceil_params->max_pwr_5g_low_mcs0 = MAX_TX_PWR(wifi_max_tx_pwr_5g_low_mcs0);
	tx_pwr_ceil_params->max_pwr_5g_low_mcs7 = MAX_TX_PWR(wifi_max_tx_pwr_5g_low_mcs7);
	tx_pwr_ceil_params->max_pwr_5g_mid_mcs0 = MAX_TX_PWR(wifi_max_tx_pwr_5g_mid_mcs0);
	tx_pwr_ceil_params->max_pwr_5g_mid_mcs7 = MAX_TX_PWR(wifi_max_tx_pwr_5g_mid_mcs7);
	tx_pwr_ceil_params->max_pwr_5g_high_mcs0 = MAX_TX_PWR(wifi_max_tx_pwr_5g_high_mcs0);
	tx_pwr_ceil_params->max_pwr_5g_high_mcs7 = MAX_TX_PWR(wifi_max_tx_pwr_5g_high_mcs7);
}

struct rf_hex_param {
	const char *hex_str;
	uint8_t *bytes;
	int bytes_len;
};

static struct rf_hex_param rf_params[NUM_WIFI_PARAMS] = {
	{NRF_WIFI_PARAMS1, NULL, 0},  {NRF_WIFI_PARAMS2, NULL, 0},  {NRF_WIFI_PARAMS3, NULL, 0},
	{NRF_WIFI_PARAMS4, NULL, 0},  {NRF_WIFI_PARAMS5, NULL, 0},  {NRF_WIFI_PARAMS6, NULL, 0},
	{NRF_WIFI_PARAMS7, NULL, 0},  {NRF_WIFI_PARAMS8, NULL, 0},  {NRF_WIFI_PARAMS9, NULL, 0},
	{NRF_WIFI_PARAMS10, NULL, 0}, {NRF_WIFI_PARAMS11, NULL, 0}, {NRF_WIFI_PARAMS12, NULL, 0},
	{NRF_WIFI_PARAMS13, NULL, 0}, {NRF_WIFI_PARAMS14, NULL, 0}, {NRF_WIFI_PARAMS15, NULL, 0},
	{NRF_WIFI_PARAMS16, NULL, 0}, {NRF_WIFI_PARAMS17, NULL, 0}, {NRF_WIFI_PARAMS18, NULL, 0},
	{NRF_WIFI_PARAMS19, NULL, 0}, {NRF_WIFI_PARAMS20, NULL, 0}, {NRF_WIFI_PARAMS21, NULL, 0},
	{NRF_WIFI_PARAMS22, NULL, 0},
};

/* Flat byte offsets of the RF parameter categories that carry board dependent
 * values, taken from the RF parameter definition. The ANT_GAIN_OFFSETS,
 * EDGE_BACKOFF_OFFSETS and PCB_LOSS_BYTE_OFFSETS enums in the firmware
 * interface headers describe an older flat layout and must not be used: their
 * offsets land inside the RF and calibration category.
 */
#define RF_PARAMS_TX_PWR_CEIL_OFST 8
#define RF_PARAMS_EDGE_CEIL_OFST   243
#define RF_PARAMS_ANT_GAIN_OFST    278

/* Indices within the TX power ceiling category. MCS9 is unsupported, so those
 * entries keep the values the default parameter strings carry.
 */
#define TX_PWR_CEIL_2G_DSSS    0
#define TX_PWR_CEIL_2G_MCS7    2
#define TX_PWR_CEIL_2G_MCS0    3
#define TX_PWR_CEIL_5G_MCS7    7
#define TX_PWR_CEIL_5G_MCS0    10
#define TX_PWR_CEIL_6G_MCS7    19
#define TX_PWR_CEIL_6G_MCS0    25

/* Number of 6 GHz sub-bands in the TX power ceiling and antenna gain
 * categories. The edge ceilings use two, UNII-5 and UNII-6, instead.
 */
#define NUM_6G_SUB_BANDS       6

/* Return the byte at a flat offset in the RF parameter set, which the firmware
 * receives as NUM_WIFI_PARAMS separate buffers.
 */
static uint8_t *rf_params_byte(unsigned int flat_ofst)
{
	unsigned int base = 0;
	int index;

	for (index = 0; index < NUM_WIFI_PARAMS; index++) {
		if (!rf_params[index].bytes) {
			continue;
		}

		if (flat_ofst < base + (unsigned int)rf_params[index].bytes_len) {
			return &rf_params[index].bytes[flat_ofst - base];
		}

		base += (unsigned int)rf_params[index].bytes_len;
	}

