nrfconnect/sdk-nrf/drivers/wifi/nrf71/src/fmac_main.c
	return NULL;
}

static enum nrf_wifi_status rf_params_set(unsigned int flat_ofst, uint8_t val)
{
	uint8_t *byte = rf_params_byte(flat_ofst);

	if (!byte) {
		LOG_ERR("%s: RF parameter offset %u out of range", __func__, flat_ofst);
		return NRF_WIFI_STATUS_FAIL;
	}

	*byte = val;

	return NRF_WIFI_STATUS_SUCCESS;
}

/* Antenna gain fields are signed 4-bit, two per byte, low nibble first. */
static enum nrf_wifi_status rf_params_set_nibble(unsigned int index, int8_t val)
{
	uint8_t *byte = rf_params_byte(RF_PARAMS_ANT_GAIN_OFST + index / 2);

	if (!byte) {
		LOG_ERR("%s: antenna gain index %u out of range", __func__, index);
		return NRF_WIFI_STATUS_FAIL;
	}

	if (index % 2) {
		*byte = (*byte & 0x0F) | (uint8_t)((val & 0x0F) << 4);
	} else {
		*byte = (*byte & 0xF0) | (uint8_t)(val & 0x0F);
	}

	return NRF_WIFI_STATUS_SUCCESS;
}

/* Apply the board dependent RF front-end values from the Wi-Fi node in the
 * board devicetree on top of the default parameter strings. MCS9 is
 * unsupported, so those entries are left as the defaults have them.
 *
 * The category 18 CRC is deliberately not recomputed: the firmware ignores it.
 */
static enum nrf_wifi_status rf_params_apply_board_values(void)
{
	static const uint8_t tx_pwr_ceil[] = {
		MAX_TX_PWR_DBM(wifi_max_tx_pwr_2g_dsss),
		MAX_TX_PWR_DBM(wifi_max_tx_pwr_2g_mcs7),
		MAX_TX_PWR_DBM(wifi_max_tx_pwr_2g_mcs0),
		MAX_TX_PWR_DBM(wifi_max_tx_pwr_5g_low_mcs7),
		MAX_TX_PWR_DBM(wifi_max_tx_pwr_5g_mid_mcs7),
		MAX_TX_PWR_DBM(wifi_max_tx_pwr_5g_high_mcs7),
		MAX_TX_PWR_DBM(wifi_max_tx_pwr_5g_low_mcs0),
		MAX_TX_PWR_DBM(wifi_max_tx_pwr_5g_mid_mcs0),
		MAX_TX_PWR_DBM(wifi_max_tx_pwr_5g_high_mcs0),
		MAX_TX_PWR_DBM(wifi_max_tx_pwr_6g_band1_mcs7),
		MAX_TX_PWR_DBM(wifi_max_tx_pwr_6g_band2_mcs7),
		MAX_TX_PWR_DBM(wifi_max_tx_pwr_6g_band3_mcs7),
		MAX_TX_PWR_DBM(wifi_max_tx_pwr_6g_band4_mcs7),
		MAX_TX_PWR_DBM(wifi_max_tx_pwr_6g_band5_mcs7),
		MAX_TX_PWR_DBM(wifi_max_tx_pwr_6g_band6_mcs7),
		MAX_TX_PWR_DBM(wifi_max_tx_pwr_6g_band1_mcs0),
		MAX_TX_PWR_DBM(wifi_max_tx_pwr_6g_band2_mcs0),
		MAX_TX_PWR_DBM(wifi_max_tx_pwr_6g_band3_mcs0),
		MAX_TX_PWR_DBM(wifi_max_tx_pwr_6g_band4_mcs0),
		MAX_TX_PWR_DBM(wifi_max_tx_pwr_6g_band5_mcs0),
		MAX_TX_PWR_DBM(wifi_max_tx_pwr_6g_band6_mcs0),
	};
	static const uint8_t tx_pwr_ceil_idx[] = {
		TX_PWR_CEIL_2G_DSSS,
		TX_PWR_CEIL_2G_MCS7,
		TX_PWR_CEIL_2G_MCS0,
		TX_PWR_CEIL_5G_MCS7, TX_PWR_CEIL_5G_MCS7 + 1, TX_PWR_CEIL_5G_MCS7 + 2,
		TX_PWR_CEIL_5G_MCS0, TX_PWR_CEIL_5G_MCS0 + 1, TX_PWR_CEIL_5G_MCS0 + 2,
		TX_PWR_CEIL_6G_MCS7 + 0, TX_PWR_CEIL_6G_MCS7 + 1, TX_PWR_CEIL_6G_MCS7 + 2,
		TX_PWR_CEIL_6G_MCS7 + 3, TX_PWR_CEIL_6G_MCS7 + 4, TX_PWR_CEIL_6G_MCS7 + 5,
		TX_PWR_CEIL_6G_MCS0 + 0, TX_PWR_CEIL_6G_MCS0 + 1, TX_PWR_CEIL_6G_MCS0 + 2,
		TX_PWR_CEIL_6G_MCS0 + 3, TX_PWR_CEIL_6G_MCS0 + 4, TX_PWR_CEIL_6G_MCS0 + 5,
	};
	static const uint8_t edge_ceil[] = {
			DT_PROP(NRF71_WIFI_NODE, nordic_wifi_2g_lower_edge_ceiling_dsss),
			DT_PROP(NRF71_WIFI_NODE, nordic_wifi_2g_lower_edge_ceiling_ht),
			DT_PROP(NRF71_WIFI_NODE, nordic_wifi_2g_lower_edge_ceiling_he),
			DT_PROP(NRF71_WIFI_NODE, nordic_wifi_2g_upper_edge_ceiling_dsss),
			DT_PROP(NRF71_WIFI_NODE, nordic_wifi_2g_upper_edge_ceiling_ht),
			DT_PROP(NRF71_WIFI_NODE, nordic_wifi_2g_upper_edge_ceiling_he),
			DT_PROP(NRF71_WIFI_NODE, nordic_wifi_unii_1_lower_edge_ceiling_ht),
			DT_PROP(NRF71_WIFI_NODE, nordic_wifi_unii_1_lower_edge_ceiling_he),
			DT_PROP(NRF71_WIFI_NODE, nordic_wifi_unii_1_upper_edge_ceiling_ht),
			DT_PROP(NRF71_WIFI_NODE, nordic_wifi_unii_1_upper_edge_ceiling_he),
			DT_PROP(NRF71_WIFI_NODE, nordic_wifi_unii_2a_lower_edge_ceiling_ht),
			DT_PROP(NRF71_WIFI_NODE, nordic_wifi_unii_2a_lower_edge_ceiling_he),
			DT_PROP(NRF71_WIFI_NODE, nordic_wifi_unii_2a_upper_edge_ceiling_ht),
			DT_PROP(NRF71_WIFI_NODE, nordic_wifi_unii_2a_upper_edge_ceiling_he),
			DT_PROP(NRF71_WIFI_NODE, nordic_wifi_unii_2c_lower_edge_ceiling_ht),
			DT_PROP(NRF71_WIFI_NODE, nordic_wifi_unii_2c_lower_edge_ceiling_he),
			DT_PROP(NRF71_WIFI_NODE, nordic_wifi_unii_2c_upper_edge_ceiling_ht),
			DT_PROP(NRF71_WIFI_NODE, nordic_wifi_unii_2c_upper_edge_ceiling_he),
			DT_PROP(NRF71_WIFI_NODE, nordic_wifi_unii_3_lower_edge_ceiling_ht),
			DT_PROP(NRF71_WIFI_NODE, nordic_wifi_unii_3_lower_edge_ceiling_he),
			DT_PROP(NRF71_WIFI_NODE, nordic_wifi_unii_3_upper_edge_ceiling_ht),
			DT_PROP(NRF71_WIFI_NODE, nordic_wifi_unii_3_upper_edge_ceiling_he),
			DT_PROP(NRF71_WIFI_NODE, nordic_wifi_unii_4_lower_edge_ceiling_ht),
			DT_PROP(NRF71_WIFI_NODE, nordic_wifi_unii_4_lower_edge_ceiling_he),
			DT_PROP(NRF71_WIFI_NODE, nordic_wifi_unii_4_upper_edge_ceiling_ht),
			DT_PROP(NRF71_WIFI_NODE, nordic_wifi_unii_4_upper_edge_ceiling_he),
		DT_PROP(NRF71_WIFI_NODE, nordic_wifi_unii_5_lower_edge_ceiling_ht),
		DT_PROP(NRF71_WIFI_NODE, nordic_wifi_unii_5_lower_edge_ceiling_he),
		DT_PROP(NRF71_WIFI_NODE, nordic_wifi_unii_5_upper_edge_ceiling_ht),
		DT_PROP(NRF71_WIFI_NODE, nordic_wifi_unii_5_upper_edge_ceiling_he),
		DT_PROP(NRF71_WIFI_NODE, nordic_wifi_unii_6_lower_edge_ceiling_ht),
		DT_PROP(NRF71_WIFI_NODE, nordic_wifi_unii_6_lower_edge_ceiling_he),
		DT_PROP(NRF71_WIFI_NODE, nordic_wifi_unii_6_upper_edge_ceiling_ht),
		DT_PROP(NRF71_WIFI_NODE, nordic_wifi_unii_6_upper_edge_ceiling_he),
	};
	static const int8_t ant_gain[] = {
		DT_PROP(NRF71_WIFI_NODE, nordic_wifi_ant_gain_2g),
		DT_PROP(NRF71_WIFI_NODE, nordic_wifi_ant_gain_5g_band1),
		DT_PROP(NRF71_WIFI_NODE, nordic_wifi_ant_gain_5g_band2),
		DT_PROP(NRF71_WIFI_NODE, nordic_wifi_ant_gain_5g_band3),
		DT_PROP(NRF71_WIFI_NODE, nordic_wifi_ant_gain_6g_band1),
		DT_PROP(NRF71_WIFI_NODE, nordic_wifi_ant_gain_6g_band2),
		DT_PROP(NRF71_WIFI_NODE, nordic_wifi_ant_gain_6g_band3),
		DT_PROP(NRF71_WIFI_NODE, nordic_wifi_ant_gain_6g_band4),
		DT_PROP(NRF71_WIFI_NODE, nordic_wifi_ant_gain_6g_band5),
		DT_PROP(NRF71_WIFI_NODE, nordic_wifi_ant_gain_6g_band6),
	};
	unsigned int i;

	for (i = 0; i < ARRAY_SIZE(tx_pwr_ceil); i++) {
		if (rf_params_set(RF_PARAMS_TX_PWR_CEIL_OFST + tx_pwr_ceil_idx[i],
				  tx_pwr_ceil[i]) != NRF_WIFI_STATUS_SUCCESS) {
			return NRF_WIFI_STATUS_FAIL;
		}
	}

