nrfconnect/sdk-nrf/drivers/wifi/nrf71/src/fmac_main.c
	for (i = 0; i < ARRAY_SIZE(edge_ceil); i++) {
		if (rf_params_set(RF_PARAMS_EDGE_CEIL_OFST + i,
				  edge_ceil[i]) != NRF_WIFI_STATUS_SUCCESS) {
			return NRF_WIFI_STATUS_FAIL;
		}
	}

	for (i = 0; i < ARRAY_SIZE(ant_gain); i++) {
		if (rf_params_set_nibble(i, ant_gain[i]) != NRF_WIFI_STATUS_SUCCESS) {
			return NRF_WIFI_STATUS_FAIL;
		}
	}

	return NRF_WIFI_STATUS_SUCCESS;
}

enum nrf_wifi_status nrf_wifi_fmac_config_rf_params(void *dev_ctx, unsigned int *rf_params_addr)
{
	int index;
	int cleanup_idx;
	size_t str_len;
	int ret;

	for (index = 0; index < NUM_WIFI_PARAMS; index++) {
		if (!rf_params[index].hex_str) {
			continue;
		}
		str_len = strlen(rf_params[index].hex_str);
		rf_params[index].bytes = k_malloc(str_len);
		if (!rf_params[index].bytes) {
			LOG_ERR("%s: Unable to allocate %zu bytes", __func__, str_len);
			goto cleanup;
		}

		ret = nrf_wifi_utils_hex_str_to_val(rf_params[index].bytes, (unsigned int)str_len,
						    (unsigned char *)rf_params[index].hex_str);
		if (ret < 0) {
			LOG_ERR("%s: hex_str_to_val failed", __func__);
			k_free(rf_params[index].bytes);
			rf_params[index].bytes = NULL;
			goto cleanup;
		}

		rf_params[index].bytes_len = ret;
		rf_params_addr[index] = (unsigned int)rf_params[index].bytes;
	}

	if (rf_params_apply_board_values() != NRF_WIFI_STATUS_SUCCESS) {
		goto cleanup;
	}

	return NRF_WIFI_STATUS_SUCCESS;

cleanup:
	for (cleanup_idx = 0; cleanup_idx < index; cleanup_idx++) {
		if (rf_params[cleanup_idx].bytes) {
			k_free(rf_params[cleanup_idx].bytes);
			rf_params[cleanup_idx].bytes = NULL;
		}
	}
	return NRF_WIFI_STATUS_FAIL;
}

struct nrf_wifi_vtf_params_host {
	unsigned int voltage;
	unsigned int temp;
	unsigned int x0_freq;
};

enum nrf_wifi_status nrf_wifi_fmac_config_vtf_params(struct nrf_wifi_fmac_dev_ctx *dev_ctx,
						     unsigned int voltage, unsigned int temp,
						     unsigned int x0,
						     unsigned int *vtf_buffer_start_address)
{
	struct nrf_wifi_vtf_params_host *vtf_buf;

	if (!vtf_buffer_start_address) {
		return NRF_WIFI_STATUS_FAIL;
	}

	vtf_buf = k_malloc(sizeof(*vtf_buf));
	if (!vtf_buf) {
		LOG_ERR("%s: k_malloc failed for VTF params", __func__);
		return NRF_WIFI_STATUS_FAIL;
	}

	vtf_buf->voltage = voltage;
	vtf_buf->temp = temp;
	vtf_buf->x0_freq = x0;
	*vtf_buffer_start_address = (unsigned int)vtf_buf;
	return NRF_WIFI_STATUS_SUCCESS;
}

enum nrf_wifi_status nrf_wifi_fmac_dev_add_zep(struct nrf_wifi_drv_priv_zep *drv_priv_zep)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	struct nrf_wifi_ctx_zep *rpu_ctx_zep = NULL;
	void *rpu_ctx = NULL;
	unsigned char op_band = get_nrf_wifi_op_band();
#ifdef CONFIG_NRF_WIFI_LOW_POWER
	int sleep_type = -1;

#ifndef CONFIG_NRF71_RADIO_TEST
	sleep_type = HW_SLEEP_ENABLE;
#else
	sleep_type = SLEEP_DISABLE;
#endif /* CONFIG_NRF71_RADIO_TEST */
#endif /* CONFIG_NRF_WIFI_LOW_POWER */
	struct nrf_wifi_tx_pwr_ctrl_params tx_pwr_ctrl_params;
	struct nrf_wifi_tx_pwr_ceil_params tx_pwr_ceil_params;
	unsigned int fw_ver = 0;

#if defined(CONFIG_NRF71_SR_COEX_SLEEP_CTRL_GPIO_CTRL) && \
	defined(CONFIG_NRF71_SYSTEM_MODE)
	unsigned int alt_swctrl1_function_bt_coex_status1 =
			(~CONFIG_NRF71_SR_COEX_SWCTRL1_OUTPUT) & 0x1;
	unsigned int invert_bt_coex_grant_output = CONFIG_NRF71_SR_COEX_BT_GRANT_ACTIVE_LOW;
#endif /* CONFIG_NRF71_SR_COEX_SLEEP_CTRL_GPIO_CTRL && CONFIG_NRF71_SYSTEM_MODE */

	rpu_ctx_zep = &drv_priv_zep->rpu_ctx_zep;

	rpu_ctx_zep->drv_priv_zep = drv_priv_zep;

#ifdef CONFIG_NRF71_RADIO_TEST
	rpu_ctx = nrf_wifi_rt_fmac_dev_add(drv_priv_zep->fmac_priv, rpu_ctx_zep);
#else
	rpu_ctx = nrf_wifi_sys_fmac_dev_add(drv_priv_zep->fmac_priv, rpu_ctx_zep);
#endif /* CONFIG_NRF71_RADIO_TEST */

	if (!rpu_ctx) {
		LOG_ERR("%s: nrf_wifi_fmac_dev_add failed", __func__);
		rpu_ctx_zep = NULL;
		goto err;
	}

	rpu_ctx_zep->rpu_ctx = rpu_ctx;

	status = nrf_wifi_fmac_ver_get(rpu_ctx,
				       &fw_ver);

	if (status != NRF_WIFI_STATUS_SUCCESS) {
		LOG_ERR("%s: FW version read failed", __func__);
		goto err;
	}

	LOG_DBG("Firmware (v%d.%d.%d.%d) booted successfully",
		NRF_WIFI_UMAC_VER(fw_ver),
		NRF_WIFI_UMAC_VER_MAJ(fw_ver),
		NRF_WIFI_UMAC_VER_MIN(fw_ver),
		NRF_WIFI_UMAC_VER_EXTRA(fw_ver));

	configure_tx_pwr_settings(&tx_pwr_ctrl_params,
				  &tx_pwr_ceil_params);

#if defined(CONFIG_NRF71_SR_COEX_SLEEP_CTRL_GPIO_CTRL) && \
	defined(CONFIG_NRF71_SYSTEM_MODE)
	LOG_DBG("Configuring SLEEP CTRL GPIO control register\n");
	status = nrf_wifi_coex_config_sleep_ctrl_gpio_ctrl(rpu_ctx_zep->rpu_ctx,
			alt_swctrl1_function_bt_coex_status1,
			invert_bt_coex_grant_output);
	if (status != NRF_WIFI_STATUS_SUCCESS) {
		LOG_ERR("%s: Failed to configure GPIO control register", __func__);
		goto err;
	}
#endif /* CONFIG_NRF71_SR_COEX_SLEEP_CTRL_GPIO_CTRL  && CONFIG_NRF71_SYSTEM_MODE */

	status = nrf_wifi_fmac_config_rf_params(rpu_ctx_zep->rpu_ctx,
						rpu_ctx_zep->phy_rf_params_addr);
	if (status != NRF_WIFI_STATUS_SUCCESS) {
		LOG_ERR("%s: Failed to configure RF params", __func__);
		goto err;
	}

	/* TODO: Remove hardcodes once we hook in sensor readings */
	status = nrf_wifi_fmac_config_vtf_params(rpu_ctx_zep->rpu_ctx, 243, 25, 0,
						 &rpu_ctx_zep->vtf_buffer_start_address);
	if (status != NRF_WIFI_STATUS_SUCCESS) {
		LOG_ERR("%s: Failed to configure VTF params", __func__);
		goto err;
	}

#ifdef CONFIG_NRF71_RADIO_TEST
	status = nrf_wifi_rt_fmac_dev_init(rpu_ctx_zep->rpu_ctx,
					rpu_ctx_zep->phy_rf_params_addr,
					rpu_ctx_zep->vtf_buffer_start_address,
#ifdef CONFIG_NRF_WIFI_LOW_POWER
					sleep_type,
#endif /* CONFIG_NRF_WIFI_LOW_POWER */
					NRF_WIFI_DEF_PHY_CALIB,
					op_band,
					IS_ENABLED(CONFIG_NRF_WIFI_BEAMFORMING),
					&tx_pwr_ctrl_params,
					&tx_pwr_ceil_params,
					STRINGIFY(CONFIG_NRF71_REG_DOMAIN));
#else
	status = nrf_wifi_sys_fmac_dev_init(
		rpu_ctx_zep->rpu_ctx,
#ifdef CONFIG_NRF_WIFI_LOW_POWER
		sleep_type,
#endif /* CONFIG_NRF_WIFI_LOW_POWER */
		NRF_WIFI_DEF_PHY_CALIB, op_band, IS_ENABLED(CONFIG_NRF_WIFI_BEAMFORMING),
		&tx_pwr_ctrl_params, &tx_pwr_ceil_params,
		STRINGIFY(CONFIG_NRF71_REG_DOMAIN), rpu_ctx_zep->phy_rf_params_addr,
			  rpu_ctx_zep->vtf_buffer_start_address);
#endif /* CONFIG_NRF71_RADIO_TEST */


	if (status != NRF_WIFI_STATUS_SUCCESS) {
		LOG_ERR("%s: nrf_wifi_sys_fmac_dev_init failed", __func__);
		goto err;
	}

